# CreateAlternateGUID Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..CreateAlternateGUID Method
ExporterIFCUtils Class See Also
---
Creates a GUID for the given element.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static string CreateAlternateGUID(
	Element pElement
)
```

Visual Basic
---
```text
Public Shared Function CreateAlternateGUID ( _
	pElement As Element _
) As String
```

Visual C++
---
```text
public:
static String^ CreateAlternateGUID(
	Element^ pElement
)
```

# ### Parameters
pElement
    Type: Autodesk.Revit.DB..::..Element The element.
# ### Return Value
The guid string.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace